/* ***********************************************************************************************
* 
* Mac OS X EMBEDDED
* Localizable Strings
*
 *********************************************************************************************** */


/* Alert  strings */
"OK" = "OK";
"Cancel" = "Zrušit";
"Disconnect" = "Odpojit";

"Settings" = "Nastavení";
"Ignore" = "Ignorovat";

/* Notification window title */
"Network Connection" = "Připojení k síti";
"VPN Connection" = "Připojení VPN";

/* Misc messages */
"Waiting for disconnection" = "Čeká se na ukončení PPP…";

/*  
    PPP error strings
    
    PPP will display one of the following LastCause published in the service/state
    of the PPP dictionnary.
    PPP errors contain a PPP generic part in the key "LastCause".
    and a Device specific part in the key "DeviceLastCause".
    
    The Device specific part is there to give more details of the PPP error.
    For example, for a PPP Error 8, meaning that the connection has failed, 
    we can have a Device Error detailing the failure cause, like Busy, NoDialTone...
    
    Therefore, if the device specific part is not 0, 
    PPP will display the device error message, that is defained in the bundle of the 
    corresponding PPP subtype (for example PPPSerial.ppp).
    If the Device specific part is 0, then PPP will display the PPP message.
    Device error must be formatted "Device Error %d".
    
    Device errors start from 1. PPP Error start from 0.
    If the text for the error does not exist, the error number will be displayed.
    If the text for the error exist but is empty, nothing will be displayed 
	PPP Error 5 is normal exit error and is special case in the code.  
*/

"PPP Error 0" = "Odpojeno PPP serverem. Zkuste se připojit znovu.";
"PPP Error 1" = "Připojení selhalo, protože se vyskytla nezotavitelná chyba. Zkuste se připojit znovu. Pokud potíže přetrvají, ověřte nastavení a kontaktujte správce.";
"PPP Error 2" = "Připojení selhalo, protože je nesprávné nastavení PPP. Ověřte nastavení a zkuste se připojit znovu.";
"PPP Error 3" = "PPP nemá dostatečná oprávnění pro správnou funkci.";
"PPP Error 4" = "Nelze nalézt rozšíření jádra pro PPP.";
/* "PPP Error 5" = ""; */ /* normal exit, nothing to display. this is special case in the code */
"PPP Error 6" = "Uzamčení selhalo"; /* not supported */
"PPP Error 7" = "Připojení selhalo, protože komunikační zařízení není k dispozici. Ujistěte se, že je připojené k počítači a zkuste se připojit znovu.";
"PPP Error 8" = "Připojení selhalo. Zkuste se připojit znovu. Pokud potíže přetrvají, ověřte nastavení a kontaktujte správce.";
"PPP Error 9" = "Terminálové připojení selhalo. Ověřte nastavení a zkuste se připojit znovu."; /* not supported */
"PPP Error 10" = "Nelze navázat připojení k PPP serveru. Zkuste se připojit znovu. Pokud potíže přetrvají, ověřte nastavení a kontaktujte správce.";
"PPP Error 11" = "Nelze ověřit totožnost PPP serveru"; /* not supported */
"PPP Error 12" = "Odpojeno, protože nebyla žádná síťová aktivita.";
"PPP Error 13" = "Odpojeno, protože byl dosažen časový limit.";
"PPP Error 14" = "Zpětné volání selhalo"; /* not supported */
"PPP Error 15" = "Odpojeno, protože PPP server nereaguje. Zkuste se připojit znovu.";
"PPP Error 16" = "Odpojeno komunikačním zařízením. Zkuste se připojit znovu. Pokud potíže přetrvají, ověřte nastavení.";
"PPP Error 17" = "Bylo zjištěno křížové propojení. Ověřte nastavení a zkuste se připojit znovu.";
"PPP Error 18" = "Selhala inicializace PPP";
"PPP Error 19" = "Ověření totožnosti selhalo.";
"PPP Error 20" = "Terminálový skript selhal. Ověřte nastavení a zkuste se připojit znovu.";
"PPP Error 21" = "Komunikační zařízení vybrané pro připojení neexistuje. Ověřte nastavení a zkuste se připojit znovu.";
"PPP Error 22" = "Odpojeno, protože byl dosažen limit přenosu dat.";
"PPP Error 23" = "Tento uživatel nemá povolený přístup.";
"PPP Error 24" = "Není povoleno připojení vzdálené strany. Ověřte nastavení a zkuste to znovu.";
"PPP Error 25" = "Nelze kontaktovat server. Zkuste se připojit znovu. Pokud potíže přetrvají, ověřte nastavení a kontaktujte správce.";
"PPP Error 127" = "Odpojeno. Zkuste se připojit znovu. Pokud potíže přetrvají, ověřte nastavení a kontaktujte správce.";

/* 
	PPP Device errors
	The following errors are PPP Link specific. 
	When returned by the link, they provide more accurate error than the generic PPP error.
*/

"L2TP Error 1" = "Nelze kontaktovat L2TP-VPN server. Ověřte adresu serveru a zkuste se připojit znovu. Pokud potíže přetrvají, kontaktujte správce.";
"L2TP Error 2" = "L2TP-VPN server nereaguje. Zkuste se připojit znovu. Pokud potíže přetrvají, ověřte nastavení a kontaktujte správce.";
"L2TP Error 5" = "Pokus o připojení k L2TP-VPN serveru selhal. Zkuste se připojit znovu. Pokud potíže přetrvají, ověřte nastavení a kontaktujte správce.";
/* From HI guidelines: we should never show the disconnection errors below */
"L2TP Error 6" = ""; /* "You have been disconnected from the L2TP server because the network configuration changed."; */
"L2TP Error 7" = "Chybí sdílený klíč IPSec. Ověřte nastavení a zkuste se připojit znovu.";
"L2TP Error 8" = "Chybí certifikát IPSec. Ověřte nastavení a zkuste se připojit znovu.";
"L2TP Error 9" = "Není k dispozici připojení k síti."; /* EDGE connection failed */


"PPTP Error 1" = "Nelze kontaktovat PPTP-VPN server. Ověřte adresu serveru a zkuste se připojit znovu. Pokud potíže přetrvají, kontaktujte správce.";
"PPTP Error 2" = "PPTP-VPN server nereaguje. Zkuste se připojit znovu. Pokud potíže přetrvají, ověřte nastavení a kontaktujte správce.";
"PPTP Error 5" = "Pokus o připojení k PPTP-VPN serveru selhal. Zkuste se připojit znovu. Pokud potíže přetrvají, ověřte nastavení a kontaktujte správce.";
/* From HI guidelines: we should never show the disconnection errors below */
"PPTP Error 6" = ""; /* "You have been disconnected from the PPTP server because the network configuration changed."; */
"PPTP Error 7" = "Není k dispozici připojení k síti."; /* EDGE connection failed */



/*  
    IPSec error strings
    
    IPSec will display one of the following errors.
*/

/* "IPSec Error 0" = ""; */ /* no error */
"IPSec Error 1" = "Vyskytla se neočekávaná chyba."; /* Generic error */
"IPSec Error 2" = "Nebyla zadána adresa VPN serveru."; /* No Server Address error */
"IPSec Error 3" = "Nebyl zadán sdílený klíč VPN."; /* No Shared Secret error */
"IPSec Error 4" = "Nebyl zadán certifikát VPN."; /* No Certificate error */
"IPSec Error 5" = "VPN server nelze nalézt."; /* Server Address did not resolve error */
"IPSec Error 6" = "Není k dispozici připojení k síti."; /* No Local Network error */
"IPSec Error 7" = "Vyskytla se chyba konfigurace."; /* Configuration error */
"IPSec Error 8" = "Vyskytla se nezotavitelná chyba."; /* Racoon Control error */
"IPSec Error 9" = "VPN server nereaguje."; /* Connection error */
"IPSec Error 10" = "Komunikace s VPN serverem selhala."; /* Negotiation error */
"IPSec Error 11" = "Sdílený klíč VPN je nesprávný."; /* Invalid Shared Secret error */
"IPSec Error 12" = "Nelze vyhodnotit certifikát serveru."; /* Certificate authentication error */
"IPSec Error 13" = "Ověření totožnosti certifikátu selhalo."; /* Certificate authentication error */
"IPSec Error 13, Re-enroll" = "Ověření totožnosti certifikátu selhalo. Kontaktujte správce sítě nebo zkuste opakovat registraci v Nastavení."; /* Certificate authentication error with Fix Me button */
"IPSec Error 14" = "Ověření totožnosti uživatele selhalo."; /* XAUTH User Authentication error */
/* From HI guidelines: we should never show the disconnection errors below */
"IPSec Error 15" = ""; /* "You have been disconnected from the VPN server because the network configuration changed."; */ /* Network changed error */
"IPSec Error 16" = ""; /* "The connection was terminated by the VPN server. Try reconnecting."; */ /* Peer Disconnection error */
"IPSec Error 17" = ""; /* "The connection was terminated because the VPN server is not responding. Try reconnecting."; */ /* Peer Dead Detection error */
"IPSec Error 18" = "Není k dispozici připojení k síti."; /* EDGE connection failed */
"IPSec Error 19" = ""; /* "You were disconnected because there was no network activity."; */ /* Idle Timeout error */
"IPSec Error 20" = "Váš certifikát ještě není platný."; /* Client Certificate date not yet valid */
"IPSec Error 20, Re-enroll" = "Váš certifikát ještě není platný. Kontaktujte správce sítě nebo zkuste opakovat registraci v Nastavení."; /* Client Certificate date not yet valid */
"IPSec Error 21" = "Váš certifikát vypršel."; /* Certificate expired error */
"IPSec Error 21, Re-enroll" = "Váš certifikát vypršel. Kontaktujte správce sítě nebo zkuste opakovat registraci v Nastavení."; /* Certificate expired error with Fix Me button */
"IPSec Error 22" = "Serverový certifikát ještě není platný. Kontaktujte správce sítě."; /* Server Certificate date not yet valid */
"IPSec Error 23" = "Serverový certifikát vypršel. Kontaktujte správce sítě."; /* Server Certificate expiry error */
"IPSec Error 24" = "Server certifikátové identity je nesprávný. Kontaktujte správce sítě."; /* Server Certificate ID mismatched or unexpected */

/* 
	IPSec XAuth strings
	Ipsec will use those strings in the User Authentication dialogs
*/ 
"Enter your user authentication" = "Zadejte ověření totožnosti uživatele";
"Enter Username and Password." = "Zadejte ověření totožnosti uživatele";
"Answer" = "Odpovědět";
"Next PIN" = "Další PIN";
"Account" = "Účet";
"Passcode" = "Kód";
"Password" = "Heslo";


/*  
    VPN error strings
    
    VPN will display one of the following errors.
*/

/* "VPN Error 0" = ""; */ /* no error */
"VPN Error 1" = "Vyskytla se neočekávaná chyba."; /* Generic error */
"VPN Error 2" = "Nebyla zadána adresa VPN serveru."; /* No Server Address error */
"VPN Error 3" = "Nebyl zadán certifikát VPN."; /* No Certificate error */
"VPN Error 4" = "VPN server nelze nalézt."; /* Server Address did not resolve error */
"VPN Error 5" = "Není k dispozici připojení k síti."; /* No Local Network error */
"VPN Error 6" = "Vyskytla se chyba konfigurace."; /* Configuration error */
"VPN Error 7" = "Vyskytla se nezotavitelná chyba."; /* Control error */
"VPN Error 8" = "VPN server nereaguje."; /* Connection error */

/* From HI guidelines: we should never show the disconnection errors below */
"VPN Error 9" = ""; /* "You have been disconnected from the VPN server because the network configuration changed."; */ /* Network changed error */
"VPN Error 10" = ""; /* "The connection was terminated by the VPN server. Try reconnecting."; */ /* Peer Disconnection error */
"VPN Error 11" = ""; /* "The connection was terminated because the VPN server is not responding. Try reconnecting."; */ /* Peer Dead Detection error */
"VPN Error 12" = ""; /* "The connection was terminated because the VPN server is not responding. Try reconnecting."; */ /* Peer Dead Detection error */
"VPN Error 13" = ""; /* negotiation error */
"VPN Error 14" = "Ověření totožnosti uživatele selhalo."; /* XAUTH User Authentication error */
"VPN Error 15" = "Není k dispozici připojení k síti."; /* EDGE connection failed */
"VPN Error 16" = ""; /* "You were disconnected because there was no network activity."; */ /* Idle Timeout error */
"VPN Error 17" = "Neplatná adresa serveru."; /* "You were disconnected because there was no network activity."; */ /* Idle Timeout error */
"VPN Error 18" = "Připojení VPN vyžaduje start nějaké aplikace."; /* "The VPN connection requires an application to start up."; */ /* Application required error */
"VPN Error 20" = "Váš certifikát ještě není platný."; /* Client Certificate date not yet valid */
"VPN Error 20, Re-enroll" = "Váš certifikát ještě není platný. Kontaktujte správce sítě nebo zkuste opakovat registraci v Nastavení."; /* Client Certificate date not yet valid */
"VPN Error 21" = "Váš certifikát vypršel."; /* Certificate expired error */
"VPN Error 21, Re-enroll" = "Váš certifikát vypršel. Kontaktujte správce sítě nebo zkuste opakovat registraci v Nastavení."; /* Certificate expired error with Fix Me button */
"VPN Error 22" = "Serverový certifikát ještě není platný. Kontaktujte správce sítě."; /* Server Certificate date not yet valid */
"VPN Error 23" = "Serverový certifikát vypršel. Kontaktujte správce sítě."; /* Server Certificate expiry error */
"VPN Error 24" = "Server certifikátové identity je nesprávný. Kontaktujte správce sítě."; /* Server Certificate ID mismatched or unexpected */
"VPN Error 25" = "";																	/* Plugin Update */
"VPN Error 26" = "Chcete-li aktivovat připojení přes VPN, spusťte VPN aplikaci.";			/* plugin needs to be enabled */

"net.juniper.sslvpn" = "Chcete-li aktivovat připojení přes VPN, spusťte Junos Pulse.";
"com.cisco.anyconnect.applevpn.plugin" = "Chcete-li aktivovat připojení přes VPN, spusťte AnyConnect.";
